<template>
  <div id="agreement">
    <ywBar :title="'youwatch服务协议'" :isShow="isApp" style="border-bottom:1px solid #f5f6f6;background: #fff;"></ywBar>
    <div class="content" :style="{'padding-top':isApp?'auto':'0.5rem'}">
      <p style="color:#333333;text-indent: 2em;">欢迎使用 “youwatch”服务(以下称“我们”) ，为了保障您的权益，请在使用“youwatch”前，详细阅读此服务协议(以下简称“本协议”) 的所有内容，特别是
        <b>加粗部分。当您勾选“我已看过并同意《youwatch服务协议》”时，您的行为表示您同意并签署了本协议，并同意遵守本协议中的约定。</b>有表(北京) 科技有限公司(以下简称“有表公司”) 是youwatch App(以下简称“本软件”) 的所有者和运营者，本协议构成您与有表公司达成的协议，具有法律效力。
      </p>
      <br>
      <p>
        <b>根据国家法律法规变化及本软件运营需要，有表公司有权对本协议条款及相关规则不时地进行修改，修改后的内容一旦以任何形式公布在本软件上即生效，并取代此前相关内容，您应不时关注本软件公告、提示信息及协议、规则等相关内容的变动。您知悉并确认，如您不同意更新后的内容，应立即停止使用本软件；如您继续使用本软件，即视为知悉变动内容并同意接受。</b>
      </p>
      <h5>一、服务需知</h5>
      <h6><b>1、本软件运用自身开发的操作系统通过国际互联网络为用户提供购买商品等服务。使用本软件，您必须：</b></h6>
      <p>(1) 自行配备上网的所需设备，包括个人手机、平板电脑、调制解调器、路由器等；</p>
      <p>(2) 自行负担个人上网所支付的与此服务有关的电话费用、网络费用等；</p>
      <p>(3) 选择与所安装终端设备相匹配的软件版本，包括但不限于iOS、Android、iPad、Windows Phone等多个youwatch发布的应用版本。</p>
      <h6><b>2、基于本软件所提供的网络服务的重要性，您确认并同意：</b></h6>
      <p>(1) 提供的注册资料真实、准确、完整、合法有效，注册资料如有变动的，应及时更新；</p>
      <p>(2) 如果您提供的注册资料不合法、不真实、不准确、不详尽的，您需承担因此引起的相应责任及后果，并且youwatch保留终止您使用本软件各项服务的权利。</p>
      <h5>二、定义</h5>
      <h6>1、youwatch是由有表公司所有和运营的分享类电商平台，用户登录youwatch平台后，可以浏览平台上的商品和服务信息，进行商品和/或服务交易等活动。</h6>
      <h5>三、youwatch使用规则</h5>
      <h6><b>1、您可浏览youwatch陈列的商品或服务信息，如您希望选购并支付订单的，您需先登录或注册帐号，并根据页面提示提交选购的商品信息和个人信息，包括但不限于数量、规格、手机、姓名、身份证号码、送货地址等信息。如您提供的信息过期、无效进而导致youwatch无法与您取得联系的，因此导致您在使用youwatch服务中产生任何损失或增加费用的，应由您完全独自承担。</b></h6>
      <h6>2、您在注册时承诺遵守法律法规、社会主义制度、国家利益、公民合法权益、公共秩序、社会道德风尚和信息真实性等七条底线，不得在注册资料中出现违法和不良信息，且您保证在注册和使用帐号时，不得有以下情形：</h6>
      <p>(a) 违反宪法或法律法规规定的；</p>
      <p>(b) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p>
      <p>(c) 损害国家荣誉和利益的，损害公共利益的；</p>
      <p>(d) 煽动民族仇恨、民族歧视，破坏民族团结的；</p>
      <p>(e) 破坏国家宗教政策，宣扬邪教和封建迷信的；</p>
      <p>(f) 散布谣言，扰乱社会秩序，破坏社会稳定的；</p>
      <p>(g) 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</p>
      <p>(h) 侮辱或者诽谤他人，侵害他人合法权益的；</p>
      <p>(i) 含有法律、行政法规、youwatch平台禁止的其他内容的。</p>
      <p><b>若您提供给youwatch的帐号注册资料不准确，不真实，含有违法或不良信息的，youwatch有权不予注册，并保留终止您使用youwatch各项服务的权利。若您以虚假信息骗取帐号注册或帐号头像、个人简介等注册资料存在违法和不良信息的，youwatch有权采取通知限期改正、暂停使用、注销登记等措施。对于冒用关联机构或社会名人注册帐号名称的，youwatch有权注销该帐号，并向政府主管部门进行报告。</b></p>
      <h6>3、您确认：在使用youwatch服务过程中，您应当是具备完全民事权利能力和完全民事行为能力的自然人、法人或其他组织。若您不具备前述主体资格，则您及您的监护人应承担因此而导致的一切后果，youwatch有权向您的监护人追偿。</h6>
      <h6>4、您同意并保证：youwatch有权记录您在选购商品或服务时，在线填写的所有信息并提供给供货商、第三方服务提供者(包括但不限于物流公司) 或youwatch的关联公司。您保证该等信息准确、合法，您承担因该等信息错误、非法等导致的后果。您授权youwatch在本服务期间有权使用上述信息及向有关第三方提供该信息。</h6>
      <h6>5、youwatch平台上的商品和服务的价格、数量等信息随时可能发生变动，对此youwatch平台不作特别通知。由于youwatch平台上的商品的数量庞大、互联网技术因素等客观原因存在，youwatch平台上显示的信息可能存在一定的滞后和误差，对此请您知悉并理解。为最大限度的提高平台上商品信息的准确性、及时性、完整性和有效性，youwatch平台有权对商品信息进行及时的监测、修改或删除。如您提交订单后，youwatch平台发现平台的相关页面上包括但不限于商品名称、价格或数量价格等关键信息存在标注错误的，有权取消错误订单并及时通知供货商和您。</h6>
      <h6>6、您理解并同意：youwatch实行先付款后发货的方式，您及时、足额、合法的支付选购商品或服务所需的款项是供货商给您发货的前提。</h6>
      <h6>7、您支付交易款项过程中，将被邀请复查选购商品或服务的信息，包括单价、购买数量，付款方式，商品的运输方式和费用等。前述存储于youwatch服务器的订单信息被认为是您的该次交易对应的发货、退货和争议事项的证据。<b>您点击“提交订单”意味着您认可订单表格中包含的所有信息都是正确和完整的。由于众所周知的互联网技术因素等客观原因存在，youwatch显示的信息可能会有一定的滞后性或差错，对此情形您知悉并理解。由于排版错误或信息错误的情况下以不正确的价格列出来的商品，youwatch有拒绝或取消任何对以不正确的价格列出来的商品所下订单的权利。</b></h6>
      <h6>8、您理解并同意youwatch上的订单成立规则：</h6>
      <p>(a) youwatch上展示的商品以及其价格、规格等信息，其性质仅为要约邀请，是供货商希望您向其发出要约的意思表示；</p>
      <P>(b) 当您确定购买并成功提交订单时(您的订单内容应包含您希望购买的商品数量、价格及支付方式、收货人、联系方式、收货地址等信息) ，视为您向供货商发出了购买订单商品的要约；</P>
      <P>(c) 订单提交成功的信息是系统自动生成，并非供货商对您要约的承诺。<b>只有系统将订单信息反馈至供货商，经供货商确认能够满足您的订购需求并向您发货(以订单状态为准) 时，方视为供货商对您的要约作出承诺，此时您与供货商之间就该已发货商品成立了合同关系；</b>如果您在一份订单里订购了多种商品，而供货商只向您发出了其中部分商品，那么您和供货商之间的订购合同仅就该部分商品成立。您可以通过查看系统显示的订单状态，了解您与供货商之间的合同是否成立以及成立的时间。</P>
      <P>(d) 在您与供货商的买卖合同成立之前，您与供货商均有权取消相关商品的订单，订单取消后，您已支付的款项将退回您的付款账户。</P>
      <h6>9、您所选购的商品将被送至订单表格上注明的送货地址，具体物流服务由您所选购的商品的供货商提供，youwatch平台不承担责任。无论何种原因该商品不能送达到送货地址，请您尽快跟youwatch客服热线(4000116008) 取得联系，youwatch平台将通知供货商进行解决。</h6>
      <h6>10、您可以随时使用自己的帐号和登录密码登录youwatch平台，查询订单状态。</h6>
      <h6><b>11、供货商在youwatch平台上列出的所有送货时间仅为参考时间，如因以下情况造成订单延迟或无法配送、交货等，供货商不承担延迟配送、交货的责任，并有权在必要时取消订单：</b></h6>
      <p><b>(1) 用户提供的信息错误、地址不详细等原因导致的；</b></p>
      <p><b>(2) 货物送达后无人签收，导致无法配送或延迟配送的；</b></p>
      <p><b>(3) 情势变更因素导致的；</b></p>
      <p><b>(4) 因节假日、大型促销活动、预购或抢购人数众多等原因导致的；</b></p>
      <p><b>(5) 不可抗力因素导致的，例如：自然灾害、交通戒严、突发战争等。</b></p>
      <h6><b>12、youwatch平台进行优惠、促销的目的是为满足广大的消费需求，一切以牟利、排挤竞争为意图或者为达到其它恶意目的的参与行为均不予接受。若您存在以下不正当行为，一经发现youwatch平台有权会同供货商采取包括但不限于暂停发货、取消订单、拦截已发货的订单、限制账户权限等措施：</b></h6>
      <p><b>(1) 将自有账户内的优惠、促销信息转卖、转让予他人；</b></p>
      <p><b>(2) 通过youwatch平台及其合作商的合法活动页面之外的第三方交易渠道获得优惠券并在youwatch平台进行使用；</b></p>
      <p><b>(3) 在youwatch平台通过机器手段恶意批量刷取优惠券并在youwatch平台进行使用；</b></p>
      <p><b>(4) 利用软件、技术手段或其他方式在youwatch平台套取商品、优惠券、运费或者其他利益；</b></p>
      <p><b>(5) youwatch平台认定的其他不正当行为。</b></p>
      <h6><b>13、您理解并保证，您在使用youwatch服务的过程中遵守诚实信用原则，不扰乱youwatch的正常交易秩序，如果youwatch根据您的登录帐号下的交易记录及其他相关信息，发现您有以下任一情形的：</b></h6>
      <p><b>(1) 您此前通过youwatch购买的商品多数并非用于个人消费或使用用途的；</b></p>
      <p><b>(2) 您此前存在多次(2次及以上) 恶意购物行为的，即从事了相关购物行为，但积极主动终止购物目的或结果，或追求一般购物以外的目的或结果，对他人或youwatch(可能) 造成消极影响的行为。</b></p>
      <p><b>(3) youwatch有合理理由怀疑您存在违反诚实信用原则的其他行为。</b></p>
      <p><b>则，youwatch有权自行或根据供货商的要求拒绝您的购买需求，若您已下达订单的，youwatch有权单方面取消订单并通知供货商不予发货；同时，youwatch有权视情况冻结您的登录帐号，使之无法通过youwatch下达订单、购买商品。</b></p>
      <h6><b>14、您可将您与供货商关于交易的争议提交youwatch，您同意委托youwatch单方判断与该争议相关的事实及应适用的规则，进而作出处理决定，该判断和决定将对您具有法律约束力。但您理解并同意，youwatch并非司法机构，仅能以普通人的身份对证据进行鉴别，youwatch对争议的处理完全是基于您的委托，youwatch无法保证争议处理结果符合您的期望，也不对争议处理结论承担任何责任。如您因此遭受损失，您同意自行向责任方追偿。</b></h6>
      <h6>15、为使您能够及时、全面了解youwatch提供的各类商品、服务及活动，您了解并同意，youwatch可以通过您在注册、使用youwatch过程中提供的联系方式多次、长期向您发送各类商业性短信息而无需另行获得您的同意。</h6>
      <h6>16、您同意在签收商品时进行当场验收，确认商品外包装完好无损后方进行签收。若您在验收过程中发现商品存在外包装破损，您有权拒绝签收并应及时联系客服进行反馈处理；若您未对商品进行前述验收即签收的，即视为商品验收合格。若订单信息中的收货人委托他人进行商品代收，代收人的签收行为视同订单信息中的收货人本人已对商品进行签收。若商品签收后发生的毁损、遗失等情况，供货商及youwatch平台不承担任何责任。</h6>
      <h6><b>17、您知悉并同意，youwatch平台将按照《隐私政策》的约定收集、使用并保护您的相关信息。</b></h6>
      <h5>四、其他约定</h5>
      <h6>1、您如对本协议项下youwatch服务有任何疑问，请登录获取相关信息或拨打客服电话(4000116008) ，youwatch将为您提供【24】小时服务。</h6>
      <h6><b>2、责任范围和限制</b></h6>
      <p><b>A、您了解youwatch仅提供这一平台作为您获取商品或服务信息、物色交易对象、就商品和/或服务的交易进行协商及开展交易的非物理场所，但youwatch无法控制交易所涉及的物品的质量、安全或合法性，商贸信息的真实性或准确性，以及交易各方履行其在贸易协议中各项义务的能力。您应自行谨慎判断确定相关商品及/或信息的真实性、合法性和有效性，并自行承担因此产生的责任与损失。</b></p>
      <p><b>B、对发生下列情形之一所造成的不便或损害，youwatch免责：</b></p>
      <p><b>a 定期检查或施工，更新软硬件而造成的服务中断，或突发性的软硬件设备与电子通信设备故障；</b></p>
      <p><b>b 网络服务提供商线路或其他故障，黑客攻击、病毒入侵等，服务器遭受损害，无法正常运作；</b></p>
      <p><b>c 在紧急情况之下依照法律的规定而采取的措施；</b></p>
      <p><b>d您与其它任何第三方的纠纷。</b></p>
      <p><b>C、无论何种原因youwatch对您的购买行为的赔偿金额将不会超过您受到影响的当次购买行为已经实际支付的费用的总额。</b></p>
      <h6>3、所有权及知识产权：</h6>
      <p>1) youwatch上所有内容，包括但不限于文字、软件、声音、图片、录像、图表、网站架构、网站画面的安排、网页设计、在广告中的全部内容、商品以及其它信息均由youwatch或其他权利人依法拥有其知识产权，包括但不限于商标权、专利权、著作权、商业秘密等。非经youwatch或其他权利人书面同意，您不得擅自使用、修改、全部或部分复制、公开传播、改变、散布、发行或公开发表、转载、引用、链接、抓取或以其他方式使用本平台程序或内容。如有违反，您同意承担由此给youwatch或其他权利人造成的一切损失。</p>
      <p>2) youwatch平台尊重知识产权并注重保护用户享有的各项权利。在youwatch平台上，用户可能需要通过发表评论等各种方式向youwatch平台提供内容。在此情况下，用户仍然享有此等内容的完整知识产权，但承诺不将已发表于本平台的信息，以任何形式发布或授权其他主体以任何方式使用。用户在提供内容时将授予youwatch平台一项全球性的免费许可，允许youwatch平台及其关联公司使用、传播、复制、修改、再许可、翻译、创建衍生作品、出版、表演及展示此等内容。</p>
      <p>3) youwatch不保证平台上由其他权利人提供的所有内容没有侵犯任何第三方的合法权益，如您认为前述内容侵犯您的合法权益，请及时与youwatch客服联系，youwatch将在法律规定范围内协助您解决问题。</p>
      <h6><b>4、通知：所有发给您的通知都可通过短信息、常规的信件或在网站显著位置公告的方式进行传送。</b></h6>
      <h6><b>5、您了解并同意，youwatch根据自身的判断，认为您的行为涉嫌违反本协议的条款，则youwatch有权暂停或停止向您提供服务，且无须为此向您或任何第三方承担责任。</b></h6>
      <h6>6.本协议适用中华人民共和国的法律。当本协议的任何内容与中华人民共和国法律相抵触时，应当以法律规定为准，同时相关条款将按法律规定进行修改或重新解释，而本协议其他部分的法律效力不变。</h6>
      <h6><b>7、如用户在使用youwatch服务过程中出现纠纷，应进行友好协商，若协商不成，应将纠纷提交有表公司所在地人民法院提起诉讼。</b></h6>
      <h6>8、youwatch在买卖关系中，仅作为youwatch平台的开发、运营和提供方，并提供交易过程中的其他辅助服务，并非买卖关系中的销售者。</h6>
      <h6>9、本协议自发布之日起实施，并构成您和有表公司之间的协议。</h6>
    </div>
  </div>
</template>

<script>
  import {
    helpCenterList
  } from '../api/api'
  export default {
    data() {
      return {
        isApp: true,
      }
    },
    methods: {

    },
    mounted() {

    },
    activated() {
      let device = this.whichDevice();
      if (device != "androidApp" && device != "iosApp") {
        // this.isApp = false;
      }
    },
    deactivated: function () {
      console.log("我已经离开了！");
    },
  };

</script>

<style scoped>
  #agreement {
    background: #ffffff;
    height: 100%;
  }

  .content {
    height: 100%;
    overflow: auto;
    -webkit-overflow-scrolling: touch;
    padding: 1.3rem 0.67rem 0.5rem 0.67rem;
    text-align: justify;
    font-size: .28rem;
  }

  ul {
    list-style: none;
    padding: 0;
  }

  ul li {
    padding-top: 0.5rem;
  }

  ul h6 {
    font-size: .28rem;
    font-weight: normal;
  }

  ul p {
    color: #999999;
    padding-top: 0.15rem;
  }

  h5{
    font-size: 0.28rem;
    padding-top: 0.5rem;
  }
  h6{
    font-size: 0.28rem;
    padding-top: 0.4rem;
    font-weight: normal;
  }
  p {
    padding-top: 0.15rem;
  }

</style>
